TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
uint8_t SparkFun_Bio_Sensor_Hub::setPulseWidth(uint16_t width)
{
    uint8_t bits;
    uint8_t regVal;

    switch(width)
    {
        case 69:    bits = 0; break;
        case 118:   bits = 1; break;
        case 215:   bits = 2; break;
        case 411:   bits = 3; break;
        default:    return INCORR_PARAM;
    }

    // get current register value to not overwrite anything
    regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= PULSE_MASK; // mask bits to change
    regVal |= bits;       // add bits

    writeRegisterMAX30101(CONFIGURATION_REGISTER, regVal);

    return SFE_BIO_SUCCESS;
}

uint16_t SparkFun_Bio_Sensor_Hub::readPulseWidth()
{
    uint8_t regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= READ_PULSE_MASK;

    switch(regVal)
    {
        case 0: return 69;
        case 1: return 118;
        case 2: return 215;
        case 3: return 411;
        default: return ERR_UNKNOWN;
    }
}

uint8_t SparkFun_Bio_Sensor_Hub::setSampleRate(uint16_t sampleRate)
{
    uint8_t bits;
    uint8_t regVal;

    // making sure the correct sample rate was selected

    switch(sampleRate)
    {
        case 50:    bits = 0; break;
        case 100:   bits = 1; break;
        case 200:   bits = 2; break;
        case 400:   bits = 3; break;
        case 800:   bits = 4; break;
        case 1000:  bits = 5; break;
        case 1600:  bits = 6; break;
        case 3200:  bits = 7; break;
        default:    return INCORR_PARAM;
    }

    // read-modify-write
    regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= SAMP_MASK;
    regVal |= (bits << 2);

    writeRegisterMAX30101(CONFIGURATION_REGISTER, regVal);

    return SFE_BIO_SUCCESS;
}

uint16_t SparkFun_Bio_Sensor_Hub::readSampleRate()
{
    // read the register and isolate bits
    uint8_t regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= READ_SAMP_MASK;
    regVal = (regVal >> 2);

    switch(regVal)
    {
        case 0: return 50;
        case 1: return 100;
        case 2: return 200;
        case 3: return 400;
        case 4: return 800;
        case 5: return 1000;
        case 6: return 1600;
        case 7: return 3200;
        default: return ERR_UNKNOWN;
    }
}

uint8_t SparkFun_Bio_Sensor_Hub::setAdcRange(uint16_t adcVal)
{
    uint8_t bits;
    uint8_t regVal;

    switch(adcVal)
    {
        case 2048:  bits = 0; break;
        case 4096:  bits = 1; break;
        case 8192:  bits = 2; break;
        case 16384: bits = 3; break;
        default:    return INCORR_PARAM;
    }

    regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= ADC_MASK;
    regVal |= (bits << 5);

    writeRegisterMAX30101(CONFIGURATION_REGISTER, regVal);

    return SFE_BIO_SUCCESS;
}

uint16_t SparkFun_Bio_Sensor_Hub::readAdcRange()
{
    uint8_t regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= READ_ADC_MASK;
    regVal = (regVal >> 5);

    switch(regVal)
    {
        case 0: return 2048;
        case 1: return 4096;
        case 2: return 8192;
        case 3: return 16384;
        default: return ERR_UNKNOWN;
    }
}

// original used the 3 byte write... but datasheet says no index byte is needed
uint8_t SparkFun_Bio_Sensor_Hub::getMcuType()
{
    return readByte(IDENTITY, READ_MCU_TYPE);
}

int32_t SparkFun_Bio_Sensor_Hub::getBootloaderInf()
{
    int32_t bootVers = 0;
    const size_t sizeOfRev = 4;
    int32_t revNum[sizeOfRev] = {0};

    uint8_t status = readMultipleBytes(BOOTLOADER_INFO, BOOTLOADER_VERS, 0x00, sizeOfRev, revNum);

    if(status != SFE_BIO_SUCCESS)
    {
        return ERR_UNKNOWN;
    }

    bootVers |= ((int32_t)revNum[1] << 16);
    bootVers |= ((int32_t)revNum[2] << 8);
    bootVers |= (int32_t)revNum[3];

    return bootVers;
}

uint8_t SparkFun_Bio_Sensor_Hub::max30101Control(uint8_t enable)
{
    switch(enable)
    {
        case 0:
        case 1:
            break;
        default:
            return INCORR_PARAM;
    }

    return enableWrite(ENABLE_SENSOR, ENABLE_MAX30101, enable);
}

uint8_t SparkFun_Bio_Sensor_Hub::accelControl(uint8_t accelSwitch)
{
    switch(accelSwitch)
    {
        case 0:
        case 1:
            break;
        default:
            return INCORR_PARAM;
    }

    return enableWrite(ENABLE_SENSOR, ENABLE_ACCELEROMETER, accelSwitch);
}

uint8_t SparkFun_Bio_Sensor_Hub::readMAX30101State()
{
    return readByte(READ_SENSOR_MODE, READ_ENABLE_MAX30101);
}

uint8_t SparkFun_Bio_Sensor_Hub::setOutputMode(uint8_t outputType)
{
    if(outputType > SENSOR_ALGO_COUNTER)
    {
        return INCORR_PARAM;
    }

    return writeByte(OUTPUT_MODE, SET_FORMAT, outputType);
}

uint8_t SparkFun_Bio_Sensor_Hub::setFifoThreshold(uint8_t threshold)
{
    return writeByte(OUTPUT_MODE, WRITE_SET_THRESHOLD, threshold);
}

uint8_t SparkFun_Bio_Sensor_Hub::numSamplesOutFifo()
{
    return readByte(READ_DATA_OUTPUT, NUM_SAMPLES);
}

uint8_t *SparkFun_Bio_Sensor_Hub::getDataOutFifo(uint8_t data[])
{
    uint8_t samples = numSamplesOutFifo();
    readFillArray(READ_DATA_OUTPUT, READ_DATA, samples, data);
    return data;
}

uint8_t SparkFun_Bio_Sensor_Hub::numSamplesExternalSensor()
{
    return readByte(READ_DATA_INPUT, SAMPLE_SIZE, WRITE_ACCELEROMETER);
}

void SparkFun_Bio_Sensor_Hub::writeRegisterMAX30101(uint8_t regAddr, uint8_t regVal)
{
    writeByte(WRITE_REGISTER, WRITE_MAX30101, regAddr, regVal);
}

void SparkFun_Bio_Sensor_Hub::writeRegisterAccel(uint8_t regAddr, uint8_t regVal)
{
    writeByte(WRITE_REGISTER, WRITE_ACCELEROMETER, regAddr, regVal);
}

uint8_t SparkFun_Bio_Sensor_Hub::readRegisterMAX30101(uint8_t regAddr)
{
    return readByte(READ_REGISTER, READ_MAX30101, regAddr);
}

uint8_t SparkFun_Bio_Sensor_Hub::readRegisterAccel(uint8_t regAddr)
{
    return readByte(READ_REGISTER, READ_ACCELEROMETER, regAddr);
}

sensorAttr SparkFun_Bio_Sensor_Hub::getAfeAttributesMAX30101()
{
    sensorAttr maxAttr = {0};
    uint8_t tempArray[2]{};

    uint8_t status = readFillArray(READ_ATTRIBUTES_AFE, RETRIEVE_AFE_MAX30101, 2, tempArray);

    if(status == SFE_BIO_SUCCESS)
    {
        maxAttr.byteWord = tempArray[0];
        maxAttr.availRegisters = tempArray[1];
    }

    return maxAttr;
}

