TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
uint8_t SparkFun_Bio_Sensor_Hub::readDiastolicVals(uint8_t userArray[])
{
    const size_t numDiasVals = 3;
    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, DIASTOLIC_VALUE, numDiasVals, userArray);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeSystolicVals(uint8_t sysVal1, uint8_t sysVal2, uint8_t sysVal3)
{
    const size_t numSysVals = 3;
    uint8_t sysVals[3] = {sysVal1, sysVal2, sysVal3};

    return writeBytes(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, SYSTOLIC_VALUE, sysVals, numSysVals);
}

uint8_t SparkFun_Bio_Sensor_Hub::readSystolicVals(uint8_t userArray[])
{
    const size_t numSysVals = 3;

    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, SYSTOLIC_VALUE, numSysVals, userArray);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeBPTAlgoData(uint8_t bptCalibData[])
{
    const size_t numCalibVals = 824;
    return writeBytes(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, BPT_CALIB_DATA, bptCalibData, numCalibVals);
}

uint8_t SparkFun_Bio_Sensor_Hub::readBPTAlgoData(uint8_t userArray[])
{
    const size_t numCalibVals = 824;
    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, BPT_CALIB_DATA, numCalibVals, userArray);
}

uint8_t SparkFun_Bio_Sensor_Hub::isPatientResting(uint8_t resting)
{
    switch(resting)
    {
        case 0:
        case 1:
            break;
        default:
            return INCORR_PARAM;
    }

    return writeByte(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, PATIENT_RESTING, resting);
}

uint8_t SparkFun_Bio_Sensor_Hub::isPatientResting()
{
    return readByte(READ_ALGORITHM_CONFIG, BPT_CONFIG, PATIENT_RESTING);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeSP02AlgoCoef(int32_t intA, int32_t intB, int32_t intC)
{
    const size_t numCoefVals = 3;
    int32_t coefVals[numCoefVals] = {intA, intB, intC};

    return writeLongBytes(CHANGE_ALGORITHM_CONFIG, BPT_CONFIG, AGC_SP02_COEFS, coefVals, numCoefVals);
}

uint8_t SparkFun_Bio_Sensor_Hub::readSP02AlgoCoef(int32_t userArray[])
{
    return readMultipleBytes(READ_ALGORITHM_CONFIG, BPT_CONFIG, AGC_SP02_COEFS, 3, userArray);
}

//// DRIVER FUNCTIONS ////

uint8_t SparkFun_Bio_Sensor_Hub::enableWrite(uint8_t _familyByte, uint8_t _indexByte, uint8_t _enableByte)
{
    // write sequence
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _enableByte;

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    // specific hub processing delays
    if(_familyByte == ENABLE_SENSOR && _indexByte == ENABLE_MAX30101)
    {
        __delay_cycles(45000); // 45ms @ 1MHz
    }
    else if(_familyByte == ENABLE_ALGORITHM && _indexByte == ENABLE_AGC_ALGO)
    {
        __delay_cycles(10000); // 10ms @ 1MHz
    }
    else if(_familyByte == ENABLE_ALGORITHM && _indexByte == ENABLE_WHRM_ALGO)
    {
        __delay_cycles(50000); // 50ms @ 1MHz
    }
    
    // read back the single status byte
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG));
    uint8_t statusByte = UCB0RXBUF;

    while (UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

// version with one write byte
uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte)
{
    if(DEBUG) uart_write_string("\twriteByte (1 write) part 1\n");

    uint8_t statusByte = 0xFF;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 2\n");

    // write the command
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 3\n");

    // address check
    while(UCB0CTLW0 & UCTXSTT); // wait for address
    if(UCB0IFG & UCNACKIFG)     // if no response
    {
        UCB0CTLW0 |= UCTXSTP;   // send stop
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;            // return error
    }

    // transmit family
    while (!(UCB0IFG & UCTXIFG)); UCB0TXBUF = _familyByte;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 4\n");

    // transmit index
    while (!(UCB0IFG & UCTXIFG)); UCB0TXBUF = _indexByte;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 5\n");

    // transmit write
    while (!(UCB0IFG & UCTXIFG)); UCB0TXBUF = _writeByte;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 6\n");

    // ensure last byte is out
    while (!(UCB0IFG & UCTXIFG));
    UCB0CTLW0 |= UCTXSTP;           // generate stop
    while (UCB0CTLW0 & UCTXSTP);    // wait for bus

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 7\n");

    __delay_cycles(6000); // 6ms delay @ 1MHz

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 8\n");

    // read back the single status byte
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 9\n");

    // wait for address phase
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP; // set stop
        return 0xEE;
    }

    UCB0CTLW0 |= UCTXSTP; // set stop

    // wait for status byte
    while (!(UCB0IFG & UCRXIFG)); statusByte = UCB0RXBUF;

    if(DEBUG) uart_write_string("\twriteByte (1 write) part 10\n");

    // wait for final stop
    while (UCB0CTLW0 & UCTXSTP);

    if(DEBUG)
    {
        uart_write_string("\twriteByte (1 write) part 11 statusByte = ");
        uart_write_int(statusByte);
        uart_write_string("\n");
    }

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint8_t _writeByteTwo)
{
    uint8_t statusByte = 0xFF;

    // write sequence: family + index + data1 + data2
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByteTwo;

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG));
    statusByte = UCB0RXBUF;

    while (UCB0CTLW0 & UCTXSTP);

