TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint16_t _val)
{
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    // split the 16-bit value into two 8-bit chunks
    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = (uint8_t)(_val >> 8); // MSB
    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = (uint8_t)(_val & 0xFF); // LSB

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG));
    statusByte = UCB0RXBUF;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeLongBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, int32_t _writeVal[], const size_t _len)
{
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    for (size_t i = 0; i < _len; i++)
    {
        for (uint8_t shift = 24; shift >= 0; shift -= 8)
        {
            while (!(UCB0IFG & UCTXIFG));
            UCB0TXBUF = (uint8_t)(_writeVal[i] >> shift);
        }
    }

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG));
    statusByte = UCB0RXBUF;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint8_t _writeVal[], const size_t _len)
{
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    for (size_t i = 0; i < _len; i++)
    {
        while (!(UCB0IFG & UCTXIFG))
            ;
        UCB0TXBUF = _writeVal[i];
    }

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG));
    statusByte = UCB0RXBUF;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readByte(uint8_t _familyByte, uint8_t _indexByte)
{
    uint8_t returnByte;
    uint8_t statusByte;

    //// START A WRITE ////
    // set the address we transmit to
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition (use |= to not reset the INIT)
    UCB0CTLW0 |= UCTR | UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK flag, then send err
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }
    
    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // make sure we are good to send data (wait for transmit interrupt)
    while(!(UCB0IFG & UCTXIFG));

    // set the buffer to index byte
    UCB0TXBUF = _indexByte;

    // make sure we are good to send data (wait for transmit interrupt)
    while(!(UCB0IFG & UCTXIFG));

    // send the stop signal, use |= to not overwrite anything unnecessary
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition (we need a delay anyways)
    while(UCB0CTLW0 & UCTXSTP);

    // wait for 2 ms
    delay_ms(2);

    //// START A READ ////

    // set UCTR to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK flag, then send err
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    // make sure we are good to read data (wait for receive interrupt)
    while(!(UCB0IFG & UCRXIFG));

    // set the status byte to the buffer data
    statusByte = UCB0RXBUF;

    // the next read will be the last, set the stop & use |= to not overwrite anything unnecessary
    UCB0CTLW0 |= UCTXSTP;

    // make sure we are good to read data (wait for receive interrupt)
    while(!(UCB0IFG & UCRXIFG));
    
    // set the return byte to the buffer data
    returnByte = UCB0RXBUF;
    
    // wait for stop to finish
    while(UCB0CTLW0 & UCTXSTP);

    if (statusByte != SFE_BIO_SUCCESS)
    {
        return statusByte;
    }
    else
    {
        return returnByte;
    }
}

// similar to above, but we just add the write byte
uint8_t SparkFun_Bio_Sensor_Hub::readByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte)
{
    uint8_t returnByte;
    uint8_t statusByte;

    //// START A WRITE ////
    // set the address we transmit to
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition (use |= to not reset the INIT)
    UCB0CTLW0 |= UCTR | UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK flag, then send err
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }
    
    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // make sure we are good to send data (wait for transmit interrupt)
    while(!(UCB0IFG & UCTXIFG));

