TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    // set the buffer to index byte
    UCB0TXBUF = _indexByte;

    // make sure we are good to send data (wait for transmit interrupt)
    while(!(UCB0IFG & UCTXIFG));

    // set the buffer to write byte
    UCB0TXBUF = _writeByte;
    
    // make sure we are good to send data (wait for transmit interrupt)
    while(!(UCB0IFG & UCTXIFG));

    // send the stop signal, use |= to not overwrite anything unnecessary
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition (we need a delay anyways)
    while(UCB0CTLW0 & UCTXSTP);

    // wait for 2 ms
    delay_ms(2);

    //// START A READ ////

    // set UCTR to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK flag, then send err
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    // make sure we are good to read data (wait for receive interrupt)
    while(!(UCB0IFG & UCRXIFG));

    // set the status byte to the buffer data
    statusByte = UCB0RXBUF;

    // the next read will be the last, set the stop & use |= to not overwrite anything unnecessary
    UCB0CTLW0 |= UCTXSTP;

    // make sure we are good to read data (wait for receive interrupt)
    while(!(UCB0IFG & UCRXIFG));
    
    // set the return byte to the buffer data
    returnByte = UCB0RXBUF;
    
    // wait for stop to finish
    while(UCB0CTLW0 & UCTXSTP);

    if (statusByte != SFE_BIO_SUCCESS)
    {
        return statusByte;
    }
    else
    {
        return returnByte;
    }
}

uint16_t SparkFun_Bio_Sensor_Hub::readIntByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte)
{

    uint16_t returnVal = 0;
    uint8_t statusByte = 0xFF;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    while (UCB0CTLW0 & UCTXSTT);                 // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP; // generate stop condition
    while (UCB0CTLW0 & UCTXSTP); // wait for stop to finish

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    // read status byte
    while (!(UCB0IFG & UCTXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return 0;
    }

    // read high byte
    while (!(UCB0IFG & UCRXIFG));
    returnVal = (uint16_t)UCB0RXBUF << 8;

    // read low byte
    UCB0CTLW0 |= UCTXSTP;
    while (!(UCB0IFG & UCRXIFG));
    returnVal |= UCB0RXBUF;

    while (UCB0CTLW0 & UCTXSTP);

    return returnVal;
}

// uses uint8_t user array
uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, const size_t _len, uint8_t userArray[])
{
    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 1\n");

    uint8_t statusByte = 0xFF;

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 2\n");

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 3\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 4 (transmitted family byte)\n");

    while (!(UCB0IFG & UCTXIFG)); UCB0TXBUF = _familyByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 5 (transmitted index byte)\n");

    while (!(UCB0IFG & UCTXIFG)); UCB0TXBUF = _indexByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 6\n");

    while (!(UCB0IFG & UCTXIFG));    // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP;           // generate stop condition
    while (UCB0CTLW0 & UCTXSTP);    // wait for stop to finish

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 7\n");

    __delay_cycles(2000); // 2ms delay @ 1MHz

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 8\n");

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 9\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 10\n");

    // read status byte
    while (!(UCB0IFG & UCRXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    if(DEBUG)
    {
        uart_write_string("\treadMultipleBytes (2 byte send) part 11 statusByte = ");
        uart_write_int(statusByte);
        uart_write_string("\n");
    }

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\treadMultipleBytes (ERROR) statusByte != SFE_BIO_SUCCESS\n");
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 12\n");
    
    for (size_t i = 0; i < _len; i++)
    {
        if (i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP; // stop before last byte
        }
        while (!(UCB0IFG & UCRXIFG));
        userArray[i] = UCB0RXBUF;
        if(DEBUG)
        {
            uart_write_string("\treadMultipleBytes (2 byte send) finished loop userArray[i] = ");
            uart_write_int(userArray[i]);
            uart_write_string("\n");
        }
    }
    
    if(DEBUG) uart_write_string("\treadMultipleBytes (2 byte send) part 13\n");

    while(UCB0CTLW0 & UCTXSTP);
    return statusByte;
}

