TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
// uses uint8_t user array
uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, uint8_t userArray[])
{
    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 1\n");

    uint8_t statusByte = 0xFF;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 2\n");

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 3\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 4 (transmitted family byte)\n");

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 5 (transmitted index byte)\n");

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 6 (transmitted write byte)\n");

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 7\n");

    while (!(UCB0IFG & UCTXIFG));    // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP;           // generate stop condition
    while (UCB0CTLW0 & UCTXSTP);    // wait for stop to finish

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 8\n");

    __delay_cycles(2000); // 2ms delay @ 1MHz

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 9\n");

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 10\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;  // clear flag
        return 0xEE;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 11\n");

    // read status byte
    while (!(UCB0IFG & UCRXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    if(DEBUG)
    {
        uart_write_string("\treadMultipleBytes (uint8_t) part 12 statusByte = ");
        uart_write_int(statusByte);
        uart_write_string("\n");
    }

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\treadMultipleBytes (ERROR) statusByte != SFE_BIO_SUCCESS\n");
        UCB0CTLW0 |= UCTXSTP;
        while(!(UCB0IFG & UCRXIFG));
        uint8_t dummy = UCB0RXBUF;
        while(UCB0CTLW0 & UCTXSTP);
        return statusByte;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 13\n");
    
    for (size_t i = 0; i < _len; i++)
    {
        if (i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP; // stop before last byte
        }
        while (!(UCB0IFG & UCRXIFG));
        userArray[i] = UCB0RXBUF;
        if(DEBUG)
        {
            uart_write_string("\treadMultipleBytes (uint8_t) finished loop userArray[i] = ");
            uart_write_int(userArray[i]);
            uart_write_string("\n");
        }
    }
    
    if(DEBUG) uart_write_string("\treadMultipleBytes (uint8_t) part 14\n");

    while(UCB0CTLW0 & UCTXSTP);
    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, int32_t userArray[])
{
    uint8_t statusByte = 0xFF;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    while (UCB0CTLW0 & UCTXSTT);                 // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP; // generate stop condition
    while (UCB0CTLW0 & UCTXSTP); // wait for stop to finish

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    // read status byte
    while (!(UCB0IFG & UCTXIFG)); // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    // each 32-bit int is sent as 4 bytes big-endian
    for (size_t i = 0; i < _len; i++)
    {
        userArray[i] = 0;
        for (uint8_t j = 0; j < 4; j++)
        {
            // check if its the last byte
            if (i == (_len - 1) && j == 3)
            {
                UCB0CTLW0 |= UCTXSTP;
            }
            while (!(UCB0IFG & UCRXIFG));
            userArray[i] = (userArray[i] << 8) | UCB0RXBUF;
        }
    }

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readFillArray(uint8_t _familyByte, uint8_t _indexByte, uint8_t arraySize, uint8_t array[])
{

    // write request
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;
    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;
    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;
    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read response
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while (!(UCB0IFG & UCRXIFG));
    uint8_t statusByte = UCB0RXBUF; // first byte is always status

    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    for (uint8_t i = 0; i < arraySize; i++)
    {
        if (i == (arraySize - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }
        while (!(UCB0IFG & UCRXIFG));
        array[i] = UCB0RXBUF;
    }

    while(UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

void delay_ms(uint16_t ms)
{
    // set up timer B0
    // TBSSEL__ACLK for 32kHz clock
    // MC__UP count up
    // ID__1 clock divider = 1
    TB0CTL = TBSSEL__ACLK | MC__UP | ID__1 | TBCLR;

    // set the count value
    // with a 32kHz clock, we do about 32 counts per ms
    TB0CCR0 = 33 * ms;

    // clear the timer interrupt
    TB0CCTL0 &= ~CCIFG;

    // enable clock interrupt
    TB0CCTL0 |= CCIE;

    // enable low power mode & interrupts
    __bis_SR_register(LPM3_bits + GIE);

    // disable timer after we wake
    TB0CTL = MC__STOP;
}

