TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
#pragma vector = TIMER0_B0_VECTOR
__interrupt void Timer_B0_ISR(void)
{
    // wake CPU & exit low-power
    __bic_SR_register_on_exit(LPM3_bits);
}

// creating UART for debugging since printing doesn't seem to work
void initUART()
{
    // configure uart pins, 1.4 = TX & 1.5 = RX
    P1SEL0 |= BIT4 | BIT5;
    //    P1SEL0 &= ~(BIT4 | BIT5);

    // configure uart for 9600 baud
    UCA0CTLW0 |= UCSWRST;       // eUSCI in reset
    UCA0CTLW0 |= UCSSEL__SMCLK; // choose smclk

    UCA0BR0 = 8;
    UCA0BR1 = 0x00;
    UCA0MCTLW = 0xD600;

    UCA0CTLW0 &= ~UCSWRST; // release from reset
}

void uart_write_char(char c)
{
    while (!(UCA0IFG & UCTXIFG)); // wait for tx buffer to be empty
    UCA0TXBUF = c;
}

void uart_write_string(const char *str)
{
    while (*str)
    {
        if (*str == '\n') {
            uart_write_char('\r');
        }
        uart_write_char(*str++);
    }
}

void uart_write_int(int num)
{
    char buf[10];
    int i = 0;
    if (num == 0)
    {
        uart_write_char('0');
        return;
    }
    while (num > 0 && i < 10)
    {
        buf[i++] = (num % 10) + '0';
        num /= 10;
    }
    while (--i >= 0)
    {
        uart_write_char(buf[i]);
    }
}

void uart_clear_screen() {
    // ESC [ 2 J  = Clear entire screen
    // ESC [ H    = Move cursor to home (top-left)
    uart_write_string("\x1B[2J\x1B[H"); 
}

// Helper to set pins to a "High" state using internal pull-ups
void b_high(uint8_t pin) {
    P1DIR &= ~pin; // Set to input
    P1OUT |= pin;  // Ensure pull-up is active
}

// Helper to set pins to a "Low" state
void b_low(uint8_t pin) {
    P1OUT &= ~pin; // Write 0
    P1DIR |= pin;  // Set to output
}

void b_delay() { __delay_cycles(200); } // ~2.5kHz for maximum stability with weak pull-ups

void b_start() {
    b_high(SDA); b_high(SCL); b_delay();
    b_low(SDA); b_delay();
    b_low(SCL); b_delay();
}

void b_stop() {
    b_low(SDA); b_delay();
    b_high(SCL); b_delay();
    b_high(SDA); b_delay();
}

bool b_write(uint8_t data) {
    for (int i = 0; i < 8; i++) {
        if (data & 0x80) b_high(SDA);
        else b_low(SDA);
        b_delay();
        b_high(SCL); b_delay();
        b_low(SCL); b_delay();
        data <<= 1;
    }
    // Check for ACK
    b_high(SDA); b_delay();
    b_high(SCL); b_delay();
    bool ack = !(P1IN & SDA); // If SDA is pulled low, we have an ACK
    b_low(SCL); b_delay();
    return ack;
}

uint8_t runI2CScanner() {

    uart_write_string("Hardware Scan Starting...\r\n");
    for (uint8_t addr = 1; addr < 127; addr++) {
        UCB0I2CSA = addr;
        UCB0CTLW0 |= UCTR | UCTXSTT; // Start + Write

        uint32_t timeout = 5000;
        while ((UCB0CTLW0 & UCTXSTT) && --timeout); // Wait for Address

        if (timeout == 0) {
            // Bus is physically stuck - Reset the whole module
            UCB0CTLW0 |= UCSWRST;
            UCB0CTLW0 &= ~UCSWRST;
            continue;
        }

        if (!(UCB0IFG & UCNACKIFG)) { // SUCCESS: Device ACKed
            uart_write_string("Found i2c device at: ");
            uart_write_int(addr);
            uart_write_string("\r\n");

            // clean-up
            UCB0CTLW0 |= UCTXSTP;

            uint32_t stopTimeout = 1000;
            while((UCB0CTLW0 & UCTXSTP) && --stopTimeout);

            UCB0IFG &= ~UCNACKIFG;

            if(stopTimeout == 0)
            {
                UCB0CTLW0 |= UCSWRST;
                UCB0CTLW0 &= ~UCSWRST;
            }

            uart_write_string("Returning 1\n");
            return 1;
        }

        UCB0CTLW0 |= UCTXSTP;      // Always send STOP to release bus
        while (UCB0CTLW0 & UCTXSTP);
        UCB0IFG &= ~UCNACKIFG;     // Clear NACK flag for next loop
    }

    return 0;
}

void runI2CScannerBitBang()
{
    uart_write_string("Starting Bit-Bang I2C Scan...\r\n");

    // Ensure pins are GPIO and have internal pull-ups enabled
    P1SEL0 &= ~(SDA | SCL);
    P1SEL1 &= ~(SDA | SCL);
    P1REN |= (SDA | SCL);
    P1OUT |= (SDA | SCL);

    P1OUT |= BIT0; // Turn on LED

    for(uint8_t addr = 1; addr < 127; addr++)
    {
        // I2C Write Address = (addr << 1) + 0
        b_start();
        bool found = b_write(addr << 1);
        b_stop();

        if(found)
        {
            uart_write_string("Found bit-bang device at: ");
            uart_write_int(addr);
            uart_write_string("\r\n");
        }

        __delay_cycles(1000); // Small rest between pings
    }

    P1OUT &= ~BIT0; // Turn off LED
    uart_write_string("Scan Complete.\r\n");
}

int main(void)
{
    // stop watchdog & gpio high-impedance
    WDTCTL = WDTPW | WDTHOLD;
    PM5CTL0 &= ~LOCKLPM5;

    // init uart
    initUART();
    uart_clear_screen();    // clear the screen so we can properly see all the messages
    delay_ms(100);          // wait a little bit
    uart_write_string("\r\n--- SYSTEM STARTUP ---\n");

    // // ensure i2c lines are high
    P1SEL0 &= ~(BIT2 | BIT3);
    P1SEL1 &= ~(BIT2 | BIT3);
    P1DIR &= ~(BIT2 | BIT3); // inputs
    P1REN &= ~(BIT2 | BIT3); // external resistors

    // // toggle scl to clear
    P1DIR |= BIT3;
    for(int i = 0; i < 9; i++)
    {
        P1OUT &= ~BIT3;
        delay_ms(1);
        P1OUT |= BIT3;
        delay_ms(1);
    }

    uart_write_string("I2C Bus Recovered (ideally).\n");

    // // switch to hardware i2c mode
    P1SEL0 |= (BIT2 | BIT3);
    P1SEL1 &= ~(BIT2 | BIT3);   // double-checking
    UCB0CTLW0 = UCSWRST; // enable reset
    UCB0CTLW0 |= UCMST | UCMODE_3 | UCSYNC | UCSSEL__SMCLK | UCSWRST;
    UCB0BRW = 10;
    UCB0CTLW0 &= ~UCSWRST;

    uint8_t tester = runI2CScanner();

    // hardware scan
    if(tester == 0)
    {
        uart_write_string("CRITICAL: Hardware I2C could not find sensor.\n");
        runI2CScannerBitBang(); // last resort
        return 0;
    }
    else
    {
        uart_write_string("We exited the scanner!\n");
    }

    // init library

    uart_write_string("\n--- Initializing Bio Sensor ---\n");

    // create sensor instance
    SparkFun_Bio_Sensor_Hub bioHub(&P2DIR, &P2OUT, BIT0,
                                   &P2DIR, &P2OUT, &P2REN, BIT1,
                                   BIO_ADDRESS);

    uart_write_string("Created a sensor instance. Beginning sensor.\n");

    uint8_t result = bioHub.begin();

    // check if we got a response
    if(result == 0x00) {
        uart_write_string("SUCCESS: Bio Sensor Online!\r\n");

        // get mcu type
        uint8_t mcuType = bioHub.getMcuType();
        uart_write_string("MCU Type (0x01 expected): 0x");
        uart_write_int(mcuType);
        uart_write_string("\r\n");

        // get sensor hub version
        version hubVer = bioHub.readSensorHubVersion();
        uart_write_string("Hub Version: ");
        uart_write_int(hubVer.major);
        uart_write_string(".");
        uart_write_int(hubVer.minor);
        uart_write_string(".");
        uart_write_int(hubVer.revision);
        uart_write_string("\r\n");

        uint8_t error = bioHub.configBpm(MODE_ONE);

        if(error == SFE_BIO_SUCCESS) uart_write_string("Sensor Configured!");
        else uart_write_string("Error in configuring sensor.");
    }
    else {
        uart_write_string("Error: Initialization failed. Code: ");
        uart_write_int(result);
        uart_write_string("\r\n");
    }

    while(1); // End of test
}
